Repository: ahmtilhn/sudoku_game
Catalog: assets/localization/Localizable.xcstrings
Source language: en
Languages: ar, bn, de, es, fr, hi, id, it, ja, ko, nl, pl, pt, ru, th, tr, uk, ur, vi, zh_hans, zh_hant

# difficulty_beginner
source: Beginner
ar: المبتدئين
bn: শুরু
es: Inicio
fr: débutant
hi: शुरुआती
id: Pemula
it: Iniziante
ja: 初心者
ko: 초보자
pl: początkujący
pt: Inicio
ru: начинающий
th: ผู้เริ่มต้น
tr: Başlangıç
uk: Початківці
ur: ابتدائی
vi: Người bắt đầu
zh_hans: 初学者
zh_hant: 初學者

# difficulty_easy
source: Easy
ar: سهلة
bn: সহজ
de: einfach
es: fácil
fr: facile
hi: आसान
id: Mudah
it: facile
ja: 簡単
ko: 간단한
nl: gemakkelijk
pl: Łatwo
pt: fácil
ru: Легко
th: ง่าย
tr: Kolay
uk: Легко
ur: آسان
vi: dễ dàng
zh_hans: 易于
zh_hant: 易於

# difficulty_medium
source: Medium
ar: متوسط
bn: মধ্যম
de: Mittler
es: Medios
fr: médium
hi: मध्यम
ja: メディア
ko: 중간
pl: Średnia
ru: Средний
th: ระดับกลาง
tr: Orta
uk: Середній
ur: وسطی
vi: Trung bình
zh_hans: 平均
zh_hant: 平均

# difficulty_hard
source: Hard
ar: صعب
bn: কঠিন
de: hart
es: duro
fr: dur
hi: कठिन
id: keras
it: duro
ja: ハード
ko: 하드
pl: ciężko
pt: Hardes
ru: Твердые
th: ยาก
tr: Sert
uk: жорсткий
ur: سختی
vi: cứng
zh_hans: 硬
zh_hant: 硬

# difficulty_expert
source: Expert
ar: الخبراء
bn: বিশেষজ্ঞ
de: Experten
es: Expertos
hi: विशेषज्ञ
id: Ekspert
it: Esperti
ja: 専門家
ko: 전문가
pl: Ekspert
pt: Especialista
ru: Эксперт
th: ผู้เชี่ยวชาญ
tr: Uzman
uk: Експерт
ur: ماہرین
vi: Chuyên gia
zh_hans: 专家
zh_hant: 專家

# complete_previous_level
source: Complete the previous level
ar: إكمال المستوى السابق
bn: পূর্বের স্তর পূরণ
de: Erfüllen Sie die vorherige Ebene
es: Completar el nivel anterior
fr: Compléter le niveau précédent
hi: पिछले स्तर को पूरा करें
id: Menyelesaikan tahap sebelumnya
it: Complete il livello precedente
ja: 前のレベルを完了
ko: 이전 레벨을 완성
nl: Voltooid het vorige niveau
pl: Wystarczy ukończyć poprzedni poziom
pt: Complete o nível anterior
ru: Заполните предыдущий уровень
th: เสร็จสิ้นระดับก่อนหน้านี้
tr: Önceki seviyeyi tamamla
uk: Завершити попередній рівень
ur: پچھلے سطح پر مکمل کریں
vi: hoàn thành mức trước
zh_hans: 完成前一级
zh_hant: 完成前一級

source: New level
ar: مستوى جديد
bn: নতুন স্তর
de: Neue Ebene
es: Nuevo nivel
fr: Nouveau niveau
hi: नए स्तर
id: Tingkat Baru
it: Nuovo livello
ja: 新レベル
ko: 새로운 수준
nl: Nieuwe niveau
pl: Nowy poziom
pt: Novo nível
ru: Новый уровень
th: ระดับใหม่
tr: Yeni seviye
uk: Новий рівень
ur: نئے سطح
vi: Tỷ lệ mới
zh_hans: 新级别
zh_hant: 新級別

# best_time
source: Best: %1s
ar: أفضل :%1s
bn: সেরা :%1s
de: Das Beste:%1s
es: El mejor:%1s
fr: Le meilleur :%1s
hi: सबसे अच्छा :%1s
id: yang terbaik :%1s
it: Il meglio:%1s
ja: ベスト:%1s
ko: 최고의 :%1s
nl: De beste:%1s
pl: Najlepsze :%1s
pt: O melhor:%1s
ru: Лучше всего :%1s
th: ดีที่สุด :%1s
tr: En iyi:%1s
uk: Найкращий з них:%1s
ur: سب سے بہتر:%1s
vi: tốt nhất :%1s
zh_hans: 最好的:%1s
zh_hant: 最好的:%1s

# daily_puzzle_title
source: Daily Sudoku
ar: يوميا سودوكو
bn: সাদা সাদা
de: Tagesausgabe Sudoku
es: El día de Sudoku
fr: Le Sudoku quotidien
hi: दैनिक सुडोकू
id: Harian Sudoku
it: Il Sudoku
ja: 日常スドーコ
ko: 매일 수다쿠
nl: Dagelijkse Sudoku
pl: Codzienne Sudoku
pt: Dia do Sudoku
ru: Судоку ежедневный
th: วันอาทิตย์
tr: Günlük Sudoku
uk: Щоденний Судоку
ur: روزانہ سوڈوکو
vi: Ngày Sudoku
zh_hans: 日常苏多库
zh_hant: 日常蘇多庫

# duel_puzzle_title
source: Duel
ar: دويل
bn: দু’জনের
de: Duell
es: Duelo
hi: डुअल
it: Duello
ja: ダブル
ko: 듀얼
pt: Duelo
ru: Дуэль
th: คู่มือ
tr: Düello
uk: Дуель
ur: دوئل
zh_hans: 双重
zh_hant: 雙重

# mini_sudoku_title
source: Mini Sudoku
ar: صغير السودوكو
bn: মিনি সুদোকো
es: El Sudoku
fr: Le Sudoku
hi: मिनी सुडोक
id: Suku Sudoku
it: Il Sudoku
ja: ミニスドゥーコ
ko: 미니 수도쿠
pt: Minas de Sudoku
ru: Миний Судоку
th: ซูโดโกขนาดเล็ก
uk: Міні Судоку
ur: مینی سوڈوکو
vi: Nhỏ Sudoku
zh_hans: 微型苏多库
zh_hant: 微型蘇多庫

source: Congratulations!
ar: مبروك !
bn: শুভেচ্ছা !
de: Grüße zu!
es: ¡Felicitaciones !
fr: Félicitations !
hi: बधाई !
id: Tahniah !
it: Congratulazioni !
ja: 祝福!
ko: 축하드립니다 !
nl: Gefeliciteerd !
pl: Gratulacje !
pt: Parabéns !
ru: Поздравляем Вас!
th: ความยินดี
tr: Tebrik ederim!
uk: Вітання з Днем!
ur: مبارک ہو!
vi: Chúc mừng!
zh_hans: 祝贺!
zh_hant: 祝賀!

source: Time
ar: الوقت
bn: সময়
de: Zeit
es: tiempo
fr: temps
hi: समय
id: Waktu
it: Il tempo
ja: 時間
ko: 시간
nl: Tijd
pl: Czas
pt: tempo
ru: Время
th: เวลา
tr: Zaman
uk: Час
ur: وقت
vi: Thời gian
zh_hans: 时间
zh_hant: 時間

source: Mistakes
ar: أخطاء
bn: ভুল
de: Fehler
es: Errores
fr: erreurs
hi: गलतियां
id: Kesalahan
it: errori
ja: ミス
ko: 오류
nl: fouten
pl: błędy
pt: Erros
ru: ошибки
th: ความผิดพลาด
tr: Hatalar
uk: помилки
ur: غلطیوں
vi: sai lầm
zh_hans: 错误
zh_hant: 錯誤

source: Hints
ar: نصائح
bn: হিন্ট
de: Hinweise
es: INSENTOS
fr: Les indices
hi: हिट
id: petunjuk
it: Testimoni
ja: ヒント
ko: 힌트
nl: Hintjes
pl: wskazówek
pt: Indicações
ru: Индикация
th: สัญญาณ
tr: İpucu
uk: Напорунок
ur: ہدایتیں
vi: Ấn tượng
zh_hans: 提示
zh_hant: 提示

# continue_action
source: Continue
ar: مواصلة
bn: চলুন
de: Weiter
es: Continuar
fr: Continuez
hi: जारी
id: terus
it: Continua
ja: 続く
ko: 계속
nl: voortgaan
pl: kontynuuj
pt: Continuar
ru: Продолжайте
th: เสร็จสิ้น
tr: Devam et
uk: Продовжуйте
ur: جاری رہیں
vi: tiếp tục
zh_hans: 继续
zh_hant: 繼續

# mistakes_count
source: Mistakes: %1d
ar: أخطاء :%1d
bn: ভুল :%1d
de: Fehler zu machen:%1d
es: Los errores:%1d
fr: Les erreurs :%1d
hi: गलतियां :%1d
id: Kesalahan :%1d
it: Gli errori:%1d
ja: ミス:%1d
ko: 오류가 있는 것 :%1d
nl: De fouten:%1d
pl: Błędy →%1d
pt: Erros em:%1d
ru: Ошибки :%1d
th: ข้อผิดพลาด%1d
tr: Hatalar:%1d
uk: Помилки →%1d
ur: غلطیوں کے لئے:%1d
vi: Lỗi :%1d
zh_hans: 错误:%1d
zh_hant: 錯誤:%1d

# mistakes_limit_count
source: Mistakes: %1d/%2d
ar: أخطاء :%1d/%2d
bn: ভুল :%1d/%2d
de: Fehler zu machen:%1d/%2d
es: Los errores:%1d/%2d
fr: Les erreurs :%1d/%2d
hi: गलतियां :%1d/%2d
id: Kesalahan :%1d/%2d
it: Gli errori:%1d/%2d
ja: ミス:%1d/%2d
ko: 오류가 있는 것 :%1d/%2d
nl: De fouten:%1d/%2d
pl: Błędy →%1d/%2d
pt: Erros em:%1d/%2d
ru: Ошибки :%1d/%2d
th: ข้อผิดพลาด%1d/%2d
tr: Hatalar:%1d/%2d
uk: Помилки →%1d/%2d
ur: غلطیوں کے لئے:%1d/%2d
vi: Lỗi :%1d/%2d
zh_hans: 错误:%1d/%2d
zh_hant: 錯誤:%1d/%2d

# hints_count
source: Hints: %1d
ar: نصائح :%1d
bn: হিন্ট :%1d
de: Ein Hinweis :%1d
es: Encuentro :%1d
fr: Les indices :%1d
hi: हिट :%1d
id: Tanda yang :%1d
it: Il segno:%1d
ja: ヒント:%1d
ko: 힌트 :%1d
nl: De indruk:%1d
pl: Wskaźnik :%1d
pt: A impressão:%1d
ru: Индекс :%1d
th: สัญญาณ :%1d
tr: İpucu:%1d
uk: Наступні інструкції:%1d
ur: ہدایت کے لئے:%1d
vi: Ấn Độ:%1d
zh_hans: 提示:%1d
zh_hant: 提示:%1d

source: Round lost
ar: جولة مفقودة
bn: হারিয়ে গেল রুট
de: Runde verloren
es: Ronda perdida
fr: Round perdu
hi: खोया हुआ दौर
id: Ronde yang hilang
it: La ronda perduta
ja: ラウンド失われた
ko: 잃어버린 라운드
nl: Round verloren
pl: Złamanie rundy
pt: Ronda Perdida
ru: Круг потерян
th: รอบสูญเสีย
tr: Yuvarlak kayıp
uk: РУНТ ЗАБИТЬ
ur: گم ہو گیا
vi: vòng mất
zh_hans: 失落的轮子
zh_hant: 失落的輪子

# mistake_limit_reached
source: You made %1d wrong moves. Choose how you want to continue.
ar: أنت جعلت%1dالخطأ في التحرك: اختر كيف تريد المضي قدماً.
bn: আপনি তৈরি করেছেন%1dভুল গতি, আপনি কীভাবে চলতে চান তা নির্বাচন করুন।
de: Du hast gemacht%1dFehlerbewegungen. wählen Sie, wie Sie weitergehen möchten.
es: Y tú haces%1dLos movimientos equivocados. escoge cómo quieres seguir.
fr: Vous avez fait%1dFaites des choix, choisissez comment vous voulez continuer.
hi: आपने बनाया%1dगलत कदम उठाएं. चुनें कि आप कैसे आगे बढ़ना चाहते हैं.
id: Kamu membuat%1dLangkah yang salah. pilih cara yang ingin Anda lanjutkan.
it: Tu hai fatto%1dIl movimento sbagliato: scegli come vuoi continuare.
ja: あなたが作った%1d間違った動きを選択し、どのように進むかを選択します。
ko: 당신은 만들었다%1d잘못된 움직임을 선택하십시오.당신이 계속하고자하는 방법을 선택하십시오.
nl: Jij hebt gemaakt%1dverkeerde bewegingen. kies hoe je wilt voortzetten.
pl: Ty zrobiłeś%1dWybierz sposób, w jaki chcesz kontynuować.
pt: Você fez%1dMudanças erradas. escolha como você quer continuar.
ru: Вы сделали%1dНеправильные движения.Выберите, как вы хотите продолжить.
th: คุณทํา%1dการเคลื่อนไหวที่ผิด เลือกวิธีที่คุณต้องการที่จะดําเนินการ
tr: Sen yaptın.%1dyanlış hamleler. Nasıl devam etmek istediğinizi seçin.
uk: Ви зробили%1dВибирайте, як ви хочете продовжувати.
ur: تم نے کیا%1dغلط حرکتیں ۔ انتخاب کریں کہ آپ کس طرح جاری رکھنا چاہتے ہیں ۔
vi: Bạn đã làm%1dLời bài hát: Choose How You Want to Continue
zh_hans: 你做%1d错误的动作,选择你想要继续的方式。
zh_hant: 你做%1d錯誤的動作,選擇你想要繼續的方式。

# continue_with_coins
source: Continue for %1d coins
ar: استمر في%1d coins
bn: চলুন →%1d coinস
de: Weiter für%1d coinS
es: Continuar por%1d coinS
fr: Continuez pour%1d coinS
hi: जारी रखें%1d coinएस
id: Terus untuk%1d coinS
it: Continua per%1d coinS
ja: 続けて%1d coinS
ko: 계속해서%1d coinS 는
nl: Ga door voor%1d coinS
pl: kontynuuj dla%1d coinS
pt: Continuar por%1d coinS
ru: Продолжайте для%1d coinС
th: ต่อไปนี้%1d coins
tr: Devam et%1d coins
uk: Продовжуйте за%1d coinС
ur: جاری رہیں →%1d coins
vi: tiếp tục cho%1d coins
zh_hans: 继续为%1d coin斯
zh_hant: 繼續為%1d coin斯

source: Watch rewarded ad
ar: مشاهدة AdWords
bn: পুরস্কার প্রদর্শন
de: Werbe an Ad
es: Ver la recompensa Ad
fr: Voir la récompense
hi: इनाम देने वाले विज्ञापन
id: Lihat Ad yang dianugerahi
it: Guarda il premio ad
ja: 賞品の広告を見る
ko: 보상받은 광고를 보세요
nl: Bekijk de beloningen
pl: Zobacz nagrodzony ad
pt: Veja o Ad
ru: Смотреть награжденный Ad
th: ดูโฆษณาที่ได้รับรางวัล
tr: İzle ödüllendirilmiş reklam
uk: Запрошуємо на нагороду
ur: دیکھیں ادائیگی
vi: Xem quảng cáo được thưởng
zh_hans: 查看获奖广告
zh_hant: 檢視獲獎廣告

# restart_puzzle
source: Restart from the beginning
ar: إعادة البدء من البداية
bn: শুরু থেকে আবার শুরু
de: Wieder starten vom Anfang
es: Retorno desde el principio
fr: Rétablir dès le début
hi: शुरुआत से फिर से शुरू
id: Mulai dari awal
it: Ripristino dall’inizio
ja: 初めから再開
ko: 다시 시작부터 시작
nl: Terug starten vanaf het begin
pl: Odtworzyć od początku
pt: Retornar do início
ru: Начинать с самого начала
th: เริ่มต้นจากเริ่มต้น
tr: Baştan Başla
uk: Повернення з самого початку
ur: شروع سے دوبارہ شروع کریں
vi: Khởi động lại từ đầu
zh_hans: 从开始开始重新开始
zh_hant: 從開始開始重新開始

# not_enough_coins
source: You do not have enough coins.
ar: لا تملك ما يكفيcoinس س
bn: আপনি যথেষ্ট নেইcoinস
de: Du hast nicht genugcoinS ist
es: No tienes lo suficientecoinS de S.
fr: Vous n’avez pas assezcoinS et S.
hi: तुम्हारे पास पर्याप्त नहीं हैcoinएस।
id: Anda tidak punya cukupcoinS dan S.
it: Non hai abbastanzacoinS è
ja: あなたには足りないcoinS です。
ko: 당신은 충분하지 않습니다coinS 는
nl: Je hebt niet genoegcoinS van S.
pl: Nie masz wystarczającocoinS Źródło
pt: Você não tem o suficientecoinS e S.
ru: У вас недостаточноcoinС .
th: คุณไม่พอcoins
tr: Yeterince paran yok.coins.
uk: Ви не маєте достатньоcoinС. І
ur: آپ کو کافی نہیں ہےcoins کے
vi: Bạn không có đủcoins .
zh_hans: 你不够coin斯。
zh_hant: 你不夠coin斯。

# rewarded_ad_unavailable
source: The rewarded ad is not available right now.
ar: الإعلان المكافأة غير متوفر حاليا.
bn: পুরস্কারের বিজ্ঞাপন এখন পাওয়া যায় না।
de: Die belohnte Anzeige ist derzeit nicht verfügbar.
es: La publicidad recompensada no está disponible en este momento.
fr: L’annonce récompensée n’est pas disponible pour le moment.
hi: पुरस्कार विजेता अभी उपलब्ध नहीं हैं।
id: Ad yang dianugerahkan tidak tersedia saat ini.
it: L’annuncio premiato non è disponibile in questo momento.
ja: 報酬の広告は、現在は利用できません。
ko: 보상된 광고는 현재 이용할 수 없습니다.
nl: De belonende advertentie is momenteel niet beschikbaar.
pl: Nagrodzona reklama nie jest dostępna w tej chwili.
pt: O anúncio recompensado não está disponível atualmente.
ru: Награжденная реклама пока не доступна.
th: การโฆษณาที่ได้รับรางวัลไม่สามารถใช้ได้ในขณะนี้
tr: Ödüllü reklam şu anda mevcut değil.
uk: Зараз нагородова реклама не доступна.
ur: اس وقت ادائیگی کی ادائیگی نہیں کی جا سکتی
vi: Quảng cáo được thưởng không có sẵn ngay bây giờ.
zh_hans: 目前,获奖的广告还没有。
zh_hant: 目前,獲獎的廣告還沒有。

# rewarded_ad_prototype_body
source: The rewarded ad provider will be connected in the monetization phase. Continue now to test the recovery flow.
ar: سيتم توصيل المورد المكافأة في مرحلة التمويل.مواصلة الآن لاختبار تدفق الانتعاش.
bn: পুরস্কার প্রদানকারী বিজ্ঞাপন প্রদানকারী মুদ্রিত ফ্যাশনে সংযোগিত হবে. এখন ফিরে আসার প্রদর্শন পরীক্ষা করুন।
de: Der belohnte Anzeigeleiter wird in der Monetierungsphase verbunden sein. Weiter jetzt, um den Erholungsfluss zu testen.
es: El proveedor de anuncios premiado se conectará en la fase de monetización. Continuar ahora para probar el flujo de recuperación.
fr: Le fournisseur d'annonces récompensé sera connecté dans la phase de monétisation. Continuez maintenant pour tester le flux de récupération.
hi: पुरस्कार प्राप्त विज्ञापन प्रदाता को मुद्राकरण चरण में कनेक्ट किया जाएगा. अब पुनर्प्राप्ति प्रवाह का परीक्षण करने के लिए जारी रखें.
id: Pembekal iklan yang dianugerahkan akan terhubung dalam fasa monetisasi. lanjutkan sekarang untuk menguji aliran pemulihan.
it: Il fornitore di annunci premiati sarà collegato nella fase di monetizzazione. Continua ora per testare il flusso di recupero.
ja: 報酬を受けた広告プロバイダーは、通貨化段階で接続されます。今すぐ回復流をテストし続けてください。
ko: 보상된 광고 제공자는 통화 단계에서 연결될 것입니다.이제 회복 흐름을 테스트하십시오.
nl: De belonende advertentieprovider zal in de monetiseringsperiode verbonden zijn.Vervolg nu om de herstelstromen te testen.
pl: Nagrodzony dostawca reklam będzie podłączony w fazie monetizacji. kontynuuj teraz, aby przetestować przepływ odzyskiwania.
pt: O fornecedor de anúncios recompensado estará conectado na fase de monetização. Continue agora para testar o fluxo de recuperação.
ru: Награжденный рекламодатель будет подключен в монетаризации.Настаньте сейчас, чтобы тестировать поток выздоровления.
th: ผู้ให้บริการโฆษณาที่ได้รับรางวัลจะเชื่อมต่อในขั้นตอนการเงินสด ต่อตอนนี้เพื่อทดสอบการไหลเวียนการกู้คืน
tr: Ödüllendirilen reklam sağlayıcısı para kazanma aşamasında bağlanacaktır. Kurtarma akışını test etmek için şimdi devam edin.
uk: Нагородова рекламодавця буде підключена в етап монетізації. продовжуйте тепер, щоб перевірити потік відновлення.
ur: انعام کردہ اشتہارات فراہم کرنے والے کو منافع بخش مرحلے میں منسلک کیا جائے گا. اب دوبارہ ٹیسٹ کرنے کے لئے جاری رکھیں.
vi: Nhà cung cấp quảng cáo được thưởng sẽ được kết nối trong giai đoạn tiền tệ. tiếp tục thử nghiệm dòng hồi phục.
zh_hans: 获奖的广告提供商将在货币化阶段连接,现在继续测试恢复流。
zh_hant: 獲獎的廣告提供商將在貨幣化階段連線,現在繼續測試恢復流。

# time_up_turn_passed
source: Time is up. The turn passed to the other player.
ar: وقت الانتقال: انتقلت الدور إلى اللاعب الآخر.
bn: সময় এসেছে, ফেরতের পথ অন্য খেলোয়াড়কে দিয়েছে।
de: Die Zeit ist auf. Die Runde wurde an den anderen Spieler übertragen.
es: El tiempo se ha ido.El turno se ha pasado al otro jugador.
fr: Le temps est arrivé, le tour est passé à l'autre joueur.
hi: समय आ गया है. दौर दूसरे खिलाड़ी को पारित किया गया है.
id: Waktu sudah tiba. putaran itu dipindahkan ke pemain lain.
it: Il tempo è in arrivo: il turno è passato all'altro giocatore.
ja: 時間は上昇し、回転は他のプレイヤーに移った。
ko: 시간은 올라가고, 회전은 다른 플레이어에게 전달되었다.
nl: De tijd is op. De omloop is overgegaan naar de andere speler.
pl: Czas się skończył, a turniej przeszedł do drugiego gracza.
pt: O tempo chegou. a volta passou para o outro jogador.
ru: Время наступило. поворот перешел к другому игроку.
th: เวลาขึ้น การหมุนผ่านไปกับผู้เล่นอื่น
tr: Zaman doldu, sıra diğer oyuncuya geçti.
uk: Час закінчився, і повернення перейшло до іншого гравця.
ur: وقت آ گیا ۔ ٹور دوسرے کھلاڑی کو منتقل کر دیا گیا ۔
vi: Thời gian đã đến. vòng quay đã chuyển sang người chơi khác.
zh_hans: 时间已经到来,转转向另一名球员。
zh_hant: 時間已經到來,轉轉向另一名球員。

source: Draw!
ar: يهتدي !
bn: ড্রাইভ !
de: Draw zu machen!
es: ¡Drayo !
hi: ड्राइव !
id: Draw yang
it: Il Draw!
ja: ドラッグ!
ko: 드래그 !
nl: Draw uit!
pl: Wygrajcie !
pt: Atirar !
ru: Исключивайте !
th: การ์ตูน
tr: Çekin!
uk: Стрічка !
ur: ڈراؤنا !
vi: Đóng rổ!
zh_hans: 打字!
zh_hant: 打字!

# player_won
source: Player %1d won!
ar: لاعب%1dفوزا !
bn: খেলোয়াড়%1dজিতেন !
de: Spieler%1dSie gewann!
es: jugador%1d¡Ven!
fr: Joueur%1det gagne !
hi: खिलाड़ी%1dजीतने के लिए!
id: Pemain%1dKemenangan !
it: giocatore%1dVino il vincitore!
ja: プレイヤー%1d勝ち!
ko: 플레이어%1d승리한 것!
nl: Speler%1dWinnaar !
pl: gracz%1dZwycięzca !
pt: Jogador%1dVenha a ganhar!
ru: Игроки%1dПобедитель →
th: ผู้เล่น%1dเก็บ
tr: Oyuncu%1dKazandı!
uk: Гравець%1dПереможець
ur: کھلاڑی%1dجیتنے کے لئے!
vi: cầu thủ%1dthắng rồi!
zh_hans: 玩家%1d胜了!
zh_hant: 玩家%1d勝了!

# turns_played
source: %1d turns played.
ar: %1dلعبة العودة
bn: %1dঘুরে খেলছে।
de: %1dTurns spielt.
es: %1dEl turno jugó.
fr: %1dtourner à jouer.
hi: %1dघूमते खेलते हैं।
id: %1dTurin bermain
it: %1dIl turno giocò.
ja: %1d回転ゲーム
ko: %1d이 재생합니다.
nl: %1dDe turns speelde.
pl: %1dZwrócił się grał.
pt: %1dTorne jogado.
ru: %1dВвернулся играл.
th: %1dแปลงเล่น
tr: %1dturns oynandı.
uk: %1dЗверніть грати.
ur: %1dٹورنگ کھیلتے ہیں
vi: %1dTrò chơi quay lại
zh_hans: %1d转演玩。
zh_hant: %1d轉演玩。

source: Main menu
ar: القائمة الرئيسية
bn: প্রধান মেনু
de: Hauptmenü
es: Menú principal
fr: Menu principal
hi: मुख्य मेनू
id: Menu utama
it: Il menu principale
ja: メインメニュー
ko: 메인 메뉴
nl: Het hoofdmenu
pl: Główne menu
pt: Menu principal
ru: Главная меню
th: หลักเมนู
tr: Ana menü
uk: Головне меню
ur: اہم مینو
vi: Menu chính
zh_hans: 主菜单
zh_hant: 主選單

# turn
source: Turn %1d
ar: تحول%1d
bn: ঘুরে%1d
de: Drehen%1d
es: Torne%1d
fr: tourner%1d
hi: घूमना%1d
id: Kembali%1d
it: Torna%1d
ja: トレンド%1d
ko: 회전%1d
pl: Zwróć%1d
pt: Torne%1d
ru: Ввернуться%1d
th: แปลง%1d
tr: Dön%1d
uk: Зверніть%1d
ur: ٹور%1d
vi: quay lại%1d
zh_hans: 转%1d
zh_hant: 轉%1d

# seconds
source: %1d seconds
ar: %1dثانية
bn: %1dসেকেন্ড
de: %1dSekunden
es: %1dsegundos
fr: %1dLes secondes
hi: %1dसेकंड
id: %1dSekunder
it: %1dsecondi
ja: %1d秒
ko: %1d2초
nl: %1dTweede
pl: %1dsekundy
pt: %1dsegundo
ru: %1dВторая секунда
th: %1dวินาที
tr: %1dsaniye
uk: %1dсекунди
ur: %1dثانوی
vi: %1d2 giây
zh_hans: %1d秒钟
zh_hant: %1d秒鐘

# player_instruction
source: Player %1d: Select a cell and make one move.
ar: لاعب%1d: اختر خلية واحذف خطوة واحدة.
bn: খেলোয়াড়%1d: একটি সেল নির্বাচন করুন এবং একটি পদক্ষেপ করুন।
de: Spieler%1dWählen Sie eine Zelle aus und machen Sie einen Schritt.
es: jugador%1dSeleccione una célula y haga un paso.
fr: Joueur%1dChoisissez une cellule et faites un mouvement.
hi: खिलाड़ी%1d: एक सेल चुनें और एक कदम करें।
id: Pemain%1dPilih sel dan lakukan satu langkah.
it: giocatore%1dSelezionare una cella e fare un passo.
ja: プレイヤー%1dセルを選択して動きを一つ。
ko: 플레이어%1d: 셀을 선택하고 한 번의 움직임을 수행합니다.
nl: Speler%1d: Selecteer een cel en maak één beweging.
pl: gracz%1dWybierz komórkę i wykonaj jeden ruch.
pt: Jogador%1dSelecione uma célula e faça um passo.
ru: Игроки%1dВыберите клетку и сделайте один шаг.
th: ผู้เล่น%1d: เลือกเซลล์และทําการเคลื่อนไหวหนึ่ง
tr: Oyuncu%1dBir hücre seçin ve bir hamle yapın.
uk: Гравець%1dВиберіть клітину і зробіть один крок.
ur: کھلاڑی%1d: ایک سیل کا انتخاب کریں اور ایک حرکت کریں.
vi: cầu thủ%1d: Chọn một ô và thực hiện một chuyển động.
zh_hans: 玩家%1d选择一个单元格,然后做一个动作。
zh_hant: 玩家%1d選擇一個單元格,然後做一個動作。

# player
source: Player %1d
ar: لاعب%1d
bn: খেলোয়াড়%1d
de: Spieler%1d
es: jugador%1d
fr: Joueur%1d
hi: खिलाड़ी%1d
id: Pemain%1d
it: giocatore%1d
ja: プレイヤー%1d
ko: 플레이어%1d
nl: Speler%1d
pl: gracz%1d
pt: Jogador%1d
ru: Игроки%1d
th: ผู้เล่น%1d
tr: Oyuncu%1d
uk: Гравець%1d
ur: کھلاڑی%1d
vi: cầu thủ%1d
zh_hans: 玩家%1d
zh_hant: 玩家%1d

# today_puzzle_completed
source: Today's puzzle is complete!
ar: اليوم هو مجرد مسرحية كاملة!
bn: আজকের পজেলটি সম্পূর্ণ!
de: Das heutige Puzzle ist komplett!
es: ¡El puzzle de hoy está completo!
fr: Le puzzle d'aujourd'hui est complet !
hi: आज का पहेली पूरी हो गई है!
id: Puzzle hari ini sudah lengkap!
it: Il puzzle di oggi è completo!
ja: 今日のパズルは完璧です!
ko: 오늘의 퍼즐은 완성되었습니다!
nl: De puzzel van vandaag is voltooid!
pl: Dzisiejszy puzzle jest kompletny!
pt: O puzzle de hoje está completo!
ru: Сегодняшняя пuzzle уже закончена!
th: ปลั๊กเดือดของวันนี้เสร็จสิ้น!
tr: Bugünün puzzle'ı tamamlandı!
uk: Сьогоднішній пазюм завершений!
ur: آج کا پازل مکمل ہو گیا ہے!
vi: Puzzle hôm nay đã hoàn thành!
zh_hans: 今天的拼图已经完成了!
zh_hant: 今天的拼圖已經完成了!

# tutorial_title
source: How to play Sudoku
ar: كيفية لعب السودوكو
bn: কিভাবে সাদুকু খেলতে
de: Wie man Sudoku spielt
es: Cómo jugar Sudoku
fr: Comment jouer au Sudoku
hi: कैसे खेलते हैं Sudoku
id: Cara bermain Sudoku
it: Come giocare a Sudoku
ja: スドーコをプレイする方法
ko: Sudoku를 연주하는 방법
nl: Hoe te spelen Sudoku
pl: Jak grać w Sudoku
pt: Como jogar Sudoku
ru: Как играть в Судоку
th: วิธีการเล่นซูโดคู
tr: Sudoku nasıl oynanır
uk: Як грати в Судоку
ur: Sudoku کھیلنے کے لئے کس طرح
vi: Cách chơi Sudoku
zh_hans: 如何玩Sudoku
zh_hant: 如何玩Sudoku

# rule_rows_title
source: Complete each row
ar: إكمال كل صف
bn: প্রতিটি রান পূরণ করুন
de: Finde jede Reihe
es: Completar cada línea
fr: Compléter chaque ligne
hi: प्रत्येक पंक्ति को पूरा करें
id: Selesaikan setiap baris
it: Completare ogni riga
ja: 各行を完成
ko: 각 라인을 완성
nl: Voltooien van elke rij
pl: Wypełnij każdą kolejkę
pt: Complete cada linha
ru: Заполните каждую строку
th: เสร็จสิ้นแต่ละเส้น
tr: Her satırı tamamla
uk: Завершити кожну рядку
ur: ہر رینج کو مکمل کریں
vi: hoàn thành từng dòng
zh_hans: 完成每个行
zh_hant: 完成每個行

# rule_rows_description
source: Each number can appear only once in every row.
ar: يمكن أن يظهر كل رقم مرة واحدة فقط في كل صف.
bn: প্রতিটি সংখ্যা প্রতিটি পর্যায়ে একবারই প্রদর্শিত হতে পারে।
de: Jede Zahl kann nur einmal in jeder Reihe angezeigt werden.
es: Cada número puede aparecer sólo una vez en cada línea.
fr: Chaque numéro ne peut apparaître qu'une fois dans chaque ligne.
hi: प्रत्येक संख्या में केवल एक बार दिखाई दे सकती है।
id: Setiap angka hanya bisa muncul sekali dalam setiap urutan.
it: Ogni numero può apparire solo una volta in ogni riga.
ja: 各数字は、それぞれの順番に一度しか表示されない。
ko: 각 숫자는 각 라인에 한 번만 나타날 수 있습니다.
nl: Elke getal kan slechts één keer in elke rij verschijnen.
pl: Każde numer może pojawić się tylko raz w każdej kolejce.
pt: Cada número pode aparecer apenas uma vez em cada linha.
ru: Каждый номер может появляться только один раз в каждом ряде.
th: หมายเลขแต่ละตัวสามารถปรากฏขึ้นเพียงครั้งเดียวในแต่ละแถว
tr: Her sayı her satırda sadece bir kez görünebilir.
uk: Кожне число може з'являтися лише один раз у кожній рядку.
ur: ہر نمبر صرف ایک بار ہر سیریز میں ظاہر ہوسکتا ہے.
vi: Mỗi số chỉ có thể xuất hiện một lần trong mỗi hàng.
zh_hans: 每个数字只能在每个行中出现一次。
zh_hant: 每個數字只能在每個行中出現一次。

# rule_columns_title
source: Check each column
ar: تحقق من كل عمود
bn: প্রতিটি পৃষ্ঠা দেখুন
de: Überprüfen Sie jede Spalte
es: Ver cada columna
fr: Vérifier chaque colonne
hi: प्रत्येक स्तंभ की जांच करें
id: Periksa setiap kolom
it: Verifica ogni colonna
ja: 各コラムをチェック
ko: 각 열을 확인합니다.
nl: Bekijk elke kolom
pl: Sprawdź każdą kolumnę
pt: Verifique cada coluna
ru: Проверьте каждую колонну
th: ตรวจสอบแต่ละคอลัมน์
tr: Her sütunu kontrol et
uk: Перевірте кожну колону
ur: ہر ستون چیک کریں
vi: Kiểm tra từng cột
zh_hans: 查看每个列
zh_hant: 檢視每個列

# rule_columns_description
source: The same number cannot appear twice in a column.
ar: لا يمكن أن تظهر نفس الرقم مرتين في عمود واحد.
bn: একই সংখ্যা একটি তুলনায় দুবার দেখা যায় না।
de: Die gleiche Zahl kann nicht zweimal in einer Spalte angezeigt werden.
es: El mismo número no puede aparecer dos veces en una columna.
fr: Le même nombre ne peut pas apparaître deux fois dans une colonne.
hi: एक ही संख्या को एक स्तंभ में दो बार नहीं दिखाई देती है।
id: Angka yang sama tidak dapat muncul dua kali dalam satu kolom.
it: Il numero non può essere visualizzato due volte in una colonna.
ja: 同じ数字は、コラムに2回表示できない。
ko: 같은 숫자는 열에 두 번 나타나지 않습니다.
nl: Hetzelfde getal kan niet twee keer in een kolom verschijnen.
pl: Nie można w jednym kolumnie wyświetlać tej samej liczby dwa razy.
pt: O mesmo número não pode aparecer duas vezes em uma coluna.
ru: То же число не может появиться дважды в колоне.
th: หมายเลขเดียวกันไม่สามารถปรากฏสองครั้งในคอลัมน์
tr: Aynı sayı bir sütunda iki kez görünemez.
uk: Таке ж число не може з'явитися двічі в колоні.
ur: ایک ہی اعداد و شمار ایک ستون میں دو بار نہیں دکھائی دیتا.
vi: Số tương tự không thể xuất hiện hai lần trong một cột.
zh_hans: 同一数字不能在一个列中出现两次。
zh_hant: 同一數字不能在一個列中出現兩次。
